v1.0.1
Improved security and docs
